package namegen

import (
	"fmt"
	"math/rand"
)

var adjectives = [2][]string{
	{"Быстрый", "Умный", "Веселый", "Добрый", "Смелый", "Яркий", "Легкий", "Тихий", "Светлый", "Мудрый", "Ловкий", "Гибкий", "Сильный"},
	{"Быстрая", "Умная", "Веселая", "Доброе", "Смелая", "Яркая", "Легкая", "Тихая", "Светлая", "Мудрая", "Ловкая", "Гибкая", "Сильная"},
}

var nouns = [2][]string{
	{"Тигр", "Лев", "Леопард", "Гепард", "Ягуар", "Барс", "Орел", "Кролик", "Скорпион", "Сокол", "Ястреб", "Волк", "Медведь"},
	{"Рысь", "Лошадь", "Белка", "Собака", "Лиса", "Панда"},
}

func GenerateName() string {
	v := rand.Intn(2)

	adjective := adjectives[v][rand.Intn(len(adjectives[v]))]
	noun := nouns[v][rand.Intn(len(nouns[v]))]

	return fmt.Sprintf("%s %s", adjective, noun)
}
